# Automatically generated by Amaranth 0.5.8. Do not edit.
read_rtlil bcp_accel.il
# (script_after_read placeholder)
    synth_ecp5  -top bcp_accel
# (script_after_synth placeholder)
write_json bcp_accel.json